L=[0 0 0 0 0 80110 162700 212700 267900 326400 386000 444500 499700 549600 592200 592200];
L(2,1)=2.12e-5;L(3,2)=0.3965;L(4,3)=0.6;L(5,4)=0.8;
L(6,5)=0.6387;
for i=6:1:15
    L(i+1,i)=0.5688;
end
m=length(L);
aa = eig(L);
%模最大特征值
lamba=aa(1);
%稳定的年龄分布
n0=[1];
for i=2:1:m
    tt=1;
    for j=1:1:i-1
        tt=tt*L(j+1,j);
    end
    n0(i)=tt/(lamba.^(i-1));
end
%何时达到稳定分布
X0=[5.21e7,1100,443,266,213,136,77,44,25,14,8,5,3,1,1,1];
X(:,1)=X0;
for k=1:40
    X(:,k+1)=L*X(:,k);
end
%预测污染的影响
L1=L;
L1(2,1)=2.12*.75*10e-5;
L1(3,2)=0.3965*0.85;
L1(4,3)=0.6*0.85;
L(5,4)=0.8*0.85;
L(6,5)=0.6387*0.85;
for i=6:1:15
    L1(i+1,i)=0.5688*0.9;
end
m1=length(L1);
bb = eig(L1);
%模最大特征值
lamba1=bb(1);
%稳定的年龄分布
n1=[1];
for i=2:1:m1
    tt=1;
    for j=1:1:i-1
        tt=tt*L1(j+1,j);
    end
    n1(i)=tt/(lamba1.^(i-1));
end